Revit 2027 API
ParameterTypeId.BuilidingPadStructureIdParam Property
 "Structure"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId BuilidingPadStructureIdParam { get; }
Public Shared ReadOnly Property BuilidingPadStructureIdParam As ForgeTypeId
	Get
public:
static property ForgeTypeId^ BuilidingPadStructureIdParam {
	ForgeTypeId^ get ();
}
static member BuilidingPadStructureIdParam : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace